docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE42-b_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m01.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m02.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m03.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m04.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m05.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m06.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m07.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h00m08.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h00m09.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m10.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 41 MB   3.6 MB/s
     data_sent......................: 91 kB   8.1 kB/s
     http_req_blocked...............: avg=158.54µs min=240ns   med=270ns    max=5.93ms   p(90)=371ns    p(95)=490ns   
     http_req_connecting............: avg=28.83µs  min=0s      med=0s       max=1.01ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=152.34ms min=14.73ms med=79.88ms  max=623.49ms p(90)=285.25ms p(95)=287.37ms
       { expected_response:true }...: avg=152.34ms min=14.73ms med=79.88ms  max=623.49ms p(90)=285.25ms p(95)=287.37ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=5.51ms   min=61.64µs med=224.5µs  max=62.72ms  p(90)=10.26ms  p(95)=11ms    
     http_req_sending...............: avg=73.02µs  min=35.65µs med=59.7µs   max=787.11µs p(90)=96.69µs  p(95)=100.44µs
     http_req_tls_handshaking.......: avg=113.31µs min=0s      med=0s       max=4.05ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=146.75ms min=14.58ms med=79.63ms  max=613.32ms p(90)=270.47ms p(95)=275.2ms 
     http_reqs......................: 61      5.449124/s
     iteration_duration.............: avg=361.05ms min=86.1ms  med=354.82ms max=704.95ms p(90)=369.14ms p(95)=429.48ms
     iterations.....................: 30      2.679897/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m11.2s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m11.1s/24h0m0s  30/30 iters, 30 per VU