docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE42-d_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m00.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m01.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m02.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m03.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m04.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m05.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m06.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h00m07.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h00m08.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h00m09.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m10.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121      ✗ 0  
     data_received..................: 41 MB   3.6 MB/s
     data_sent......................: 86 kB   7.7 kB/s
     http_req_blocked...............: avg=183.32µs min=240ns   med=271ns    max=6.84ms   p(90)=521ns    p(95)=551ns   
     http_req_connecting............: avg=40.09µs  min=0s      med=0s       max=1.48ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=151.46ms min=14.76ms med=81.52ms  max=631.25ms p(90)=278.67ms p(95)=284.71ms
       { expected_response:true }...: avg=151.46ms min=14.76ms med=81.52ms  max=631.25ms p(90)=278.67ms p(95)=284.71ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 61 
     http_req_receiving.............: avg=4.61ms   min=39.83µs med=434.06µs max=18.58ms  p(90)=10.16ms  p(95)=12.38ms 
     http_req_sending...............: avg=155.03µs min=33.68µs med=59.09µs  max=1.75ms   p(90)=142.86µs p(95)=716.91µs
     http_req_tls_handshaking.......: avg=114.75µs min=0s      med=0s       max=4.26ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=146.7ms  min=14.51ms med=81.26ms  max=621.6ms  p(90)=268.95ms p(95)=273.48ms
     http_reqs......................: 61      5.478532/s
     iteration_duration.............: avg=359.11ms min=88.62ms med=355.13ms max=712.04ms p(90)=373.38ms p(95)=383.38ms
     iterations.....................: 30      2.69436/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0d00h00m11.1s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m11.0s/24h0m0s  30/30 iters, 30 per VU