docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE42-f_management.cattle.io.setting.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m00.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h00m01.9s/24h0m0s  27/30 iters, 30 per VU

     ✓ listing management.cattle.io.setting from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121       ✗ 0  
     data_received..................: 4.8 MB  2.2 MB/s
     data_sent......................: 22 kB   9.9 kB/s
     http_req_blocked...............: avg=1.07ms   min=241ns   med=271ns    max=60.74ms  p(90)=370ns    p(95)=471ns  
     http_req_connecting............: avg=35.17µs  min=0s      med=0s       max=1.48ms   p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=31.44ms  min=14.56ms med=38.13ms  max=77.3ms   p(90)=45.25ms  p(95)=46.5ms 
       { expected_response:true }...: avg=31.44ms  min=14.56ms med=38.13ms  max=77.3ms   p(90)=45.25ms  p(95)=46.5ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 61 
     http_req_receiving.............: avg=818.12µs min=49.02µs med=296.24µs max=5.14ms   p(90)=2.04ms   p(95)=2.54ms 
     http_req_sending...............: avg=164.65µs min=31.43µs med=41.99µs  max=2.24ms   p(90)=122.09µs p(95)=1.22ms 
     http_req_tls_handshaking.......: avg=117.06µs min=0s      med=0s       max=3.7ms    p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=30.46ms  min=14.31ms med=36.77ms  max=77.05ms  p(90)=43.86ms  p(95)=44.22ms
     http_reqs......................: 61      27.84373/s
     iteration_duration.............: avg=70.64ms  min=60.83ms med=67.23ms  max=138.36ms p(90)=74.37ms  p(95)=84.21ms
     iterations.....................: 30      13.693638/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m02.2s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m02.1s/24h0m0s  30/30 iters, 30 per VU